#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//int main()
//{
//	double a = 5 % 2;                                            //取模时，两边必须是整数类型
//  double b = 5 / 2.0;                                          //除法得到的返回值是商----商2余1
//	printf("a = %lf\n", a);
//  printf("b = %lf\n", b);
//	return 0;
//}

//int main()
//{
//	int a = 16;
//	//>> -- 右移操作符
//	//移动的是二进制位
//	//0000 0000 0000 0000 0000 0000 0001 0000=16
//	//0000 0000 0000 0000 0000 0000 0000 1000=8                //右移一位
//	int b = a >> 2;                                            //右移两位
//  //0000 0000 0000 0000 0000 0000 0000 0100=4                //算术右移：右边丢弃，左边补原符号位，正数为0，负数为1。通常都是算术移位
//	printf("%d\n", b);                                         //逻辑右移：右边丢弃，左边补0
//	return 0;                                                  //右移一位有除以2的效果
//}





//int main()
//{
//	int a = -1;
//	//
//	//整数的二进制表示有：原码、反码、补码
//	//存储到内存的是补码
//	//10000000000000000000000000000001 - 原码
//	//11111111111111111111111111111110 - 反码：符号位不变，其余位取反
//	//11111111111111111111111111111111 - 补码：反码+1
//	//所以存进去的结果是补码：全1
//	int b = a >> 1;                                            //右移后看情况，一般是算数位移
//	printf("%d\n", b);
//	return 0;
//}
//int main()
//{
//	int a = 5;
//	int b = a << 1;
//	//0000 0000 0000 0000 0000 0000 0000 0101=5
//  //0000 0000 0000 0000 0000 0000 0000 1010=10               //左移后，右边直接补0
//	printf("%d\n", b);                                         //左移一位，有*2的效果
//	return 0;
//}
//                                                             //对于移位操作符，不支持移负数位





//位操作符：按位与，按位或，按位异或                           //操作数必须是整数类型即int

//int main()
//{
//	                                                           //& ---- 按2进制位与
//	/*int a = 3;
//	int b = 5;
//	int c = a&b;*/
//	                                                           //0000 0000 0000 0000 0000 0000 0000 0011
//	                                                           //0000 0000 0000 0000 0000 0000 0000 0101
//	                                                           //0000 0000 0000 0000 0000 0000 0000 0001
//	//printf("%d\n", c);
//                                                             //若是负数，则要转换成补码形式，再与二进制数按位与操作
//
// 
// 
//	                                                           //| ---- 按2进制位或
//	/*int a = 3;
//	int b = 5;
//	int c = a | b;
//	printf("%d\n", c);*/
//	                                                           //0000 0000 0000 0000 0000 0000 0000 0011
//	                                                           //0000 0000 0000 0000 0000 0000 0000 0101
//	                                                           //0000 0000 0000 0000 0000 0000 0000 0111
//	
// 
// 
//	                                                           //按2进制位异或
//	//相同为0，相异为1
//	/*int a = 3;
//	int b = 5;
//	int c = a ^ b;
//	printf("%d\n", c);
//	*/
//	                                                           //0000 0000 0000 0000 0000 0000 0000 0011
//	                                                           //0000 0000 0000 0000 0000 0000 0000 0101
//	                                                           //0000 0000 0000 0000 0000 0000 0000 0110
//	//
//	return 0;
//}





//不创建临时变量，交换两个数的值

//int main()
//{
//	int a = 3;
//	int b = 5;
//	//int tmp = 0;
//  //创建临时变量的方法
//	printf("before: a=%d b=%d\n", a, b);
//	//tmp = a;
//	//a = b;
//	//b = tmp;
//
//	//加减法----可能会溢出
//	/*a = a + b;
//	b = a - b;
//	a = a - b;*/
//
//	//异或的方法
//	a = a^b;//a=011=3  b=101=5  a=ans=110=6     //a^b产生的密码a，与原来的b异或，能得到原来的a
//	b = a^b;//a=110=6  b=101=5  b=ans=011=3     //a^b产生的密码a，与原来的a异或，能得到原来的b
//	a = a^b;//a=110=6  b=011=3  a=ans=101=5     //就能实现交换
//
//	printf("after : a=%d b=%d\n", a, b);
//
//	return 0;
//}





//求一个整数存储在内存中的二进制中1的个数
//即求补码中1的个数
//123
//如何得到10进制数中的每一位：除10模10，可以得到，前提是正数
//二进制就是模2除2

//int main()
//{
//	int num = 0;
//	int count = 0;
//	scanf("%d", &num);//-1
//                                                             //用到了按位与和移位操作符
//	int i = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (1 == ((num >> i) & 1))                             //向右移动i位并且与1与，若结果为1
//			count++;                                           //则计数1
//	}
//	printf("%d\n", count);
//
//	//32bit
//	//num&1 == 1
//  //当num按位与1，若结果为1，说明它的最低位一定是1，否则说明它的最低位是0   
//  //实现方式是将num依次右移即可，让左边的数，依次变为右边的最低位
//	//0000 0000 0000 0000 0000 0000 0000 0011=num1
//  //0000 0000 0000 0000 0000 0000 0000 0010=num2
//	//0000 0000 0000 0000 0000 0000 0000 0001=1
//	//0000 0000 0000 0000 0000 0000 0000 0001=1=ans1
//  //0000 0000 0000 0000 0000 0000 0000 0000=0=ans2
//	//统计num的补码中有几个1
//	/*while (num)                                              //假设是                                3----011
//	{                                                          //模2之后，判断余数是否为1       3/2=1…1----  1
//		if (num % 2 == 1)                                      //除2之后，num放的是商          num=3/2=1----01
//			count++;                                           //模2之后，再判断余数是否为1     1/2=0…1---- 1
//		num = num / 2;                                         //除2，此时是0/2商是0，num=0    num=1/2=0
//	}*/                                                        //num为0时，while循环停止
//                                                             //这样的算法算不了负数
//
//	//printf("%d\n", count);
//	return 0;
//}




//赋值操作符

//int main()
//{
//	int a = 0;
//	if (a)
//	{
//		printf("呵呵\n");
//	}
//	if (!a)
//	{
//		printf("呵呵\n");
//	}
//	/*printf("%d\n", !a);*/
//
//	//a = a + 2;
//	//a += 2;//复合赋值符
//	//
//	//a = a >> 1;
//	//a >>= 1;
//
//	//a = a & 1;
//	//a &= 1;
//
//	return 0;
//}
//
//int main()
//{
//	int a = -5;
//	a = -a;
//
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int* p = &a;//取地址操作符
//	*p = 20;//解引用操作符
//	return 0;
//}
//
//int main()
//{
//	int a = 10;
//	char c = 'r';
//	char* p = &c;
//	int arr[10] = { 0 };
//	//sizeof 计算的变量所占内存空间的大小，单位是字节
//	printf("%d\n", sizeof a);//4
//	printf("%d\n", sizeof(int));//
//
//	printf("%d\n", sizeof(c));//1
//	printf("%d\n", sizeof(char));//
//
//	printf("%d\n", sizeof(p));//4
//	printf("%d\n", sizeof(char*));//
//
//	printf("%d\n", sizeof(arr));//40
//	printf("%d\n", sizeof(int [10]));//
//
//	return 0;
//}

//int main()
//{
//	int ch = 0;
//	while ((ch = getchar()) != EOF)
//	{
//		if (ch<'A' || ch>'Z')
//		{
//			continue;
//		}
//		putchar(ch);
//	}
//	return 0;
//}



//int main()
//{
//	//这种创建数组的方式，是数组有10个元素，把第一个元素初始化为0，其余元素默认初始化为0
//	int arr1[10] = { 0 };
//	//这种创建数组的方式，不直接指定数组的元素个数，次数数组根据初始化的内容，来指定元素个数
//	//因为{}中只有一个0，所以数组arr2中只有一个元素。
//	int arr2[] = { 0 };
//
//	printf("%d\n", sizeof(arr1));
//	printf("%d\n", sizeof(arr2));
//
//}